#נתונה רשימת נתונים בזיכרון הנתונים . כל נתון גודלו בית . (הרשימה מתחילה בכתובת ברגיסטר שנתונה    
# ואורכ נתון $a0 ה        . $a1 ברגיסטר  . signed הנח כי הנתונים  רשומים  בתור
#מצא את הנתון הגדול ביותר והכנס אותו   .   . $v0 לרגיסטר הצג  את הנתון  הגדול  על מסך המחשב  
#הערות:  . הערות בגוף התוכנית  חובה   

# aviad klein
#id 315552679
# Lab 2.1
.data
array : .byte 2 6 8 10 12 -12 -14 -100 100 36
.text
la $a0,array
la $a1 10

lb $v0,0($a0) # טעינת האיבר הראשון במערך לרגיסטר v0
loop:
lb $t0,0($a0) # טעינת האיבר הראשון במערך ל t0
slt $t1,$v0, $t0 ,# אם v0 קטן מ t0 אז t1= אחד, אחרת = 0
beq $t1,$zero,next # קפוץ לליבל next  אם t1 = 0 
addi $v0,$t0,0 # $v0 = $t0
next :
addi $a0,$a0,1 # העבר את a0 להצביע על האיבר הבא
addi $a1,$a1,-1 # הקטן ב1 את מספר האיברים במערך
beq $a1,$zero,finish # אם a1 = 0 סיים
j loop 
finish :
addi $a0,$v0,0 # טען את הנתון הגבוה במערך לרגיסטר a0
li $v0,1 # קוד 1 בv0 לצרוך הדפסה
syscall # קריאת מערכת לצורך הדפסה
